public class Main {
    public static void main(String[] args) {
        System.out.println("\nЭта программа решает кубическое уравнения вида x^3 + ax^2 + bx + c = 0\n");
        
        CubicEquationSolver equation = new CubicEquationSolver(1e-8, -2.98, -9.08, -5.1);
        equation.solve();
    }
}

// 1: 1e-3, 0, 0, 0
// 2: 1e-4, -3, 3,-1
// 3: 1e-3, -13.2, 58.04, -85.008
// 4: 1e-2, -3.87, 4.9923, -2.14669
// 5: 1e-5, -3, 5, -15
// 6: 1e-5, 10, 5, 50
// 7: 1e-5, 1.001, 1, 1.001
// 8: 1e-5, -824, 15, -12360
// 9: 1e-4, -5, 8, -4
// 10: 1e-5, -4, -3, 18
// 11: 1e-3, -2.98, -9.08, -5.1
// 12: 1e-5, -0.998, -7.998, 11.988
// 13: 1e-8, -8, -20, 0
// 14: 1e-8, -2, -13, -10
// 15: 1e-8, 3, -10, -24
// 16: 1e-4, -1.99, -13.04, -10.05